In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7], 'col2':[111,333,111,444,222,333,111], 'col3':['abc', 'def','ghi','xyz', 'ayx','byx','cyz']})

In [14]:
df.head()

   col1  col2 col3
0     1   111  abc
1     2   333  def
2     3   111  ghi
3     4   444  xyz
4     5   222  ayx

In [7]:
df.tail()

   col1  col2 col3
2     3   111  ghi
3     4   444  xyz
4     5   222  ayx
5     6   333  byx
6     7   111  cyz

# Info and Unique Values

In [9]:
len(df['col2'].unique())

4

In [10]:
df['col2'].nunique()

4

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
col1    7 non-null int64
col2    7 non-null int64
col3    7 non-null object
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

# Value Count

In [12]:
df['col2'].value_counts()

111    3
333    2
222    1
444    1
Name: col2, dtype: int64

In [15]:
df

   col1  col2 col3
0     1   111  abc
1     2   333  def
2     3   111  ghi
3     4   444  xyz
4     5   222  ayx
5     6   333  byx
6     7   111  cyz

# Apply Functions

In [18]:
def times2(num):
    return num*2

In [19]:
df['col1'].apply(times2)

0     2
1     4
2     6
3     8
4    10
5    12
6    14
Name: col1, dtype: int64

In [20]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
Name: col3, dtype: int64

In [21]:
df['col1'].sum()

28

In [22]:
del df['col1']

In [23]:
df

   col2 col3
0   111  abc
1   333  def
2   111  ghi
3   444  xyz
4   222  ayx
5   333  byx
6   111  cyz

In [24]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [25]:
df.sort_values(by='col2') #inplace = Fassle by default

   col2 col3
0   111  abc
2   111  ghi
6   111  cyz
4   222  ayx
1   333  def
5   333  byx
3   444  xyz

In [27]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False

In [28]:
import numpy as np

In [29]:
na_df = pd.DataFrame({'col1':[1,2,3,np.nan,5,6,7], 'col2':[111,np.nan,111,444,222,np.nan,np.nan], 'col3':['abc', 'def','ghi','xyz', 'ayx','byx','cyz']})

In [30]:
na_df

   col1   col2 col3
0   1.0  111.0  abc
1   2.0    NaN  def
2   3.0  111.0  ghi
3   NaN  444.0  xyz
4   5.0  222.0  ayx
5   6.0    NaN  byx
6   7.0    NaN  cyz

In [31]:
na_df.head()

   col1   col2 col3
0   1.0  111.0  abc
1   2.0    NaN  def
2   3.0  111.0  ghi
3   NaN  444.0  xyz
4   5.0  222.0  ayx

In [33]:
na_df.fillna('FILL')

   col1  col2 col3
0     1   111  abc
1     2  FILL  def
2     3   111  ghi
3  FILL   444  xyz
4     5   222  ayx
5     6  FILL  byx
6     7  FILL  cyz